import pandas as pd

__ListOfNutritionAttr__ = [
    'קלוריות',
    'חלבונים',
    'פחמימות',
    'מתוכן סוכרים',
    'שומנים',
    'מתוכם שומן רווי',
    'כולסטרול',
    'נתרן',
    'סיבים תזונתיים',
    'מים',
    'ליקופן',
    'ויטמין A',
    'סה"כ ויטמין B',
    'ויטמין B1',
    'ויטמין B2',
    'ויטמין B3 - ניאצין',
    'ויטמין B5',
    'ויטמין B6',
    'חומצה פולית - ויטמין B9',
    'ויטמין C',
    'ויטמין E',
    'ויטמין K',
    'סידן',
    'ברזל',
    'מגנזיום',
    'זרחן',
    'אבץ',
    'אשלגן',
    'חומצות שומן רב בלתי רוויות',
    'חומצה אלפא לינולנית-אומגה 3',
    'חומצה לינולאית-אומגה 6',
    'חומצות שומן חד בלתי רוויות',
    'חומצת שומן אולאית-אומגה 9',
    'קלוריות',
    'חלבונים',
    'פחמימות',
    'מתוכן סוכרים',
    'שומנים',
    'מתוכם שומן רווי',
    'כולסטרול',
    'נתרן',
    'סיבים תזונתיים',
    'מים',
    'ויטמין A',
    'סה"כ ויטמין B',
    'ויטמין B1',
    'ויטמין B2',
    'ויטמין B3 - ניאצין',
    'ויטמין B5',
    'ויטמין B6',
    'חומצה פולית - ויטמין B9',
    'ויטמין C',
    'ויטמין E',
    'ויטמין K',
    'סידן',
    'ברזל',
    'מגנזיום',
    'זרחן',
    'אבץ',
    'אשלגן',
    'חומצות שומן רב בלתי רוויות',
    'חומצה אלפא לינולנית-אומגה 3',
    'חומצה לינולאית-אומגה 6',
    'חומצות שומן חד בלתי רוויות',
    'חומצת שומן אולאית-אומגה 9'
]

]
def CreateNewDBDailyData():
    DBDailyData = None

    if DBDailyData is None:
        DBDailyData = pd.DataFrame({nutNameWOUnits: [nutValue, nutUnits]}, index=['nutValue', 'nutUnits'])
    else:
        DBDailyData.insert(0, nutNameWOUnits, [nutValue, nutUnits])

    return DBDailyData